Repository: BravoBaldo/Translations
Catalog: Node-RED/OmegaT_NodeRed/OmegaT_NodeRed-level2.tmx
Source language: en_us
Languages: it_it

source: **Link nodes** let you create a flow that can jump between tabs in the editor - they add a virtual wire from the end of one flow to the start of another.
it_it: I **Nodi Link** consentono di creare un flusso che può passare da una scheda all'altra nell'editor: aggiungono un collegamento virtuale dalla fine di un flusso all'inizio di un altro.

source: **Subflows** let you create a new node in the palette whose internal implementation is described as a flow.
it_it: I **Subflow** consentono di creare un nuovo nodo nella palette la cui implementazione interna è descritta come flusso.

source: *Since Node-RED 1.0*
it_it: *Da Node-RED 1.0*

source: *Since Node-RED 1.1.0*
it_it: *A partire da Node-RED 1.1.0*

source: *Since Node-RED 1.3*
it_it: *Da Node-RED 1.3*

source: *Since Node-RED 1.3.0*
it_it: *A partire da Node-RED 1.3.0*

source: *Since Node-RED 3.1.0*
it_it: *Da Node-RED 3.1.0*

source: // Get multiple values flow.get(["count", "colour"], function(err, count, colour) { ... })
it_it: `// Get multiple values`<br>`flow.get(["count", "colour"], function(err, count, colour) { ... })`

source: // Get value - async flow.get("count", storeName, function(err, myCount) { ... });
it_it: `// Get value - async`<br>`flow.get("count", storeName, function(err, myCount) { ... });`

source: // Set multiple values flow.set(["count", "colour"], [123, "red"], function(err) { ... }) {% endhighlight %}
it_it: `// Set multiple values`<br>`flow.set(["count", "colour"], [123, "red"], function(err) { ... })`

source: // Set single value flow.set("count", 123, function(err) { ... })
it_it: `// Set single value`<br>`flow.set("count", 123, function(err) { ... })`<br>

source: // Set value - async flow.set("count", 123, storeName, function(err) { ... }) {% endhighlight %}
it_it: `// Set value - async`<br>`flow.set("count", 123, storeName, function(err) { ... })`

source: // Set value - sync flow.set("count", 123, storeName);
it_it: `// Set value - sync`<br>`flow.set("count", 123, storeName);`

source: A different approach, as seen by the Twitter node, is to put the most 'interesting' information into the payload, in this case the text of a tweet, and put the complete metadata the API also provides into a separate `msg.tweet` property.
it_it: Un approccio diverso, come quello del nodo Twitter, consiste nell'inserire le informazioni più 'interessanti' nel payload, in questo caso il testo di un tweet, e inserire i metadati completi forniti dall'API in una proprietà separata `msg.tweet`.

source: A function can return multiple messages on an output by returning an array of messages within the returned array.
it_it: Una funzione può restituire più messaggi su un output restituendo un array di messaggi all'interno dell'array restituito.

source: A more explicit arrangement of the flows can be achieved by grouping related nodes together.
it_it: Una disposizione più esplicita dei flussi può essere ottenuta raggruppando i nodi correlati.

source: A name of `Get current time` would be much clearer.
it_it: Un nome come `Get current time` sarebbe molto più chiaro.

source: A number of nodes also treat `msg.topic` as having special meaning.
it_it: Diversi nodi trattano anche `msg.topic` come se avesse un significato speciale.

source: API Reference
it_it: Riferimento API

source: Access to any static content defined by the `httpStatic` property can be secured using the `httpStaticAuth` property, which uses the same format.
it_it: L'accesso a qualsiasi contenuto statico definito dalla proprietà `httpStatic` può essere protetto utilizzando la proprietà `httpStaticAuth`, che utilizza lo stesso formato.

source: Accessing the Admin API
it_it: Accesso all'API Admin

source: Accessing the editor with a custom token
it_it: Accesso all'editor con un token personalizzato

source: Adding Status
it_it: Aggiungere lo Stato

source: Adding longer documentation
it_it: Aggiunta di Documentazione più Estesa

source: Adding port labels
it_it: Aggiunta di Label alle Porte

source: Additional node modules cannot be loaded directly within a Function node.
it_it: I moduli nodo aggiuntivi non possono essere caricati direttamente all'interno di un nodo Funzione.

source: Advanced
it_it: Avanzate

source: All good code should have good documentation to match.
it_it: Tutto il buon codice dovrebbe essere corredato da una buona documentazione.

source: All of the techniques discussed so far relate to the visual appearance of the flows.
it_it: Tutte le tecniche discusse finora riguardano l'aspetto visivo dei flussi.

source: Along with the label, nodes can also have a custom icon.
it_it: Oltre all'etichetta, i nodi possono anche avere un'icona personalizzata.

source: An easier way for doing this is by using Subflow properties.
it_it: Un modo più semplice per farlo è utilizzare le proprietà del `Subflow`.

source: Another approach is to group all of the error handling flows below the main flow - making the 'good' path clearly distinct from the error paths.
it_it: Un altro approccio consiste nel raggruppare tutti i flussi di gestione degli errori sotto il flusso principale, rendendo il path 'corretto' chiaramente distinto dai path di errore.

source: Another consideration is how to manage any state information in your flows.
it_it: Un'altra considerazione da fare è come gestire le informazioni sullo stato nei flussi.

source: Another consideration is whether you are working alongside other developers on the same Node-RED application.
it_it: Un altro aspetto da considerare è se si sta lavorando con altri sviluppatori sulla stessa applicazione Node-RED.

source: Another option is to manage the state outside of Node-RED - such as using retained MQTT messages, or a database of some sort.
it_it: Un'altra opzione è quella di gestire lo stato al di fuori di Node-RED, ad esempio utilizzando messaggi MQTT conservati o un database di qualche tipo.

source: Any flow context inside the subflow will be scoped to the individual instances.
it_it: Qualsiasi contesto di flusso all'interno del `Subflow` sarà limitato alle singole istanze.

source: Any messages that arrive before the On Start function has completed will be queued up, and handled when it is ready.
it_it: Tutti i messaggi che arrivano prima del completamento della funzione "On Start" verranno messi in coda e gestiti quando sarà pronta.

source: Any status updates can then also be caught by the Status node.
it_it: Eventuali aggiornamenti dello stato possono quindi essere rilevati anche dal nodo "Status".

source: As a minimum, the options should include:
it_it: Come minimo, le opzioni dovrebbero includere:

source: As there is no direct visual association between a Catch node and the nodes it targets, you should consider how to position them in order to keep the flows readable.
it_it: Poiché non esiste un'associazione visiva diretta tra un nodo Catch e i nodi a cui si riferisce, è opportuno valutare come posizionarli per mantenere i flussi leggibili.

source: As with all APIs, it needs to be designed with care and attention.
it_it: Come tutte le API, deve essere progettata con cura e attenzione.

source: As with programming in general, the choice of good property names is also important.
it_it: Come per la programmazione in generale, anche la scelta di nomi di proprietà efficaci è importante.

source: As with the subflow example above, you could configure the MQTT node to publish to ${MY_TOPIC} and then set that as an environment variable before running Node-RED.
it_it: Come nell'esempio del `Subflow` precedente, è possibile configurare il nodo MQTT per pubblicare su ${MY_TOPIC} e quindi impostarlo come variabile d'ambiente prima di eseguire Node-RED.

source: As you build your flows, you may find some common parts that you want to reuse in multiple places.
it_it: Durante la creazione dei flussi, si potrebbero trovare alcune parti comuni riutilizzabili in più punti.

source: Aside from the `msg` object, the function can also store data in the context store.
it_it: Oltre all'oggetto `msg`, la funzione può anche memorizzare dati nel "context store".

source: Asynchronous context access
it_it: Accesso asincrono al contesto

source: Before Node-RED 1.0, the Function node would not clone the *first* message passed to `node.send`, but would clone the rest.
it_it: Prima di Node-RED 1.0, il nodo Funzione non clonava il *primo* messaggio passato a `node.send`, ma clonava il resto.

source: Best practices for creating clear and reusable flows
it_it: Best practice per la creazione di flussi chiari e riutilizzabili

source: But that requires adding a Change node in front of every subflow instance in order to set the desired value.
it_it: Ma questo richiede l'aggiunta di un nodo "Change" davanti a ogni istanza del `Subflow` per impostare il valore desiderato.

source: But they can also be used as a template for authenticating with other similar strategies.
it_it: Ma possono anche essere utilizzati come template per l'autenticazione con altre strategie simili.

source: But to update the flows they will require the `flows.write` permission.
it_it: Per aggiornare i flussi, invece, avrà bisogno dell'autorizzazione `flows.write`.

source: But you should take care if you later introduce nodes to the flow that do depend on its value.
it_it: Tuttavia, è necessario prestare attenzione se in seguito si introducono nel flusso nodi che dipendono dal suo valore.

source: By convention it will have a `msg.payload` property containing the body of the message.
it_it: Per convenzione, avrà una proprietà `msg.payload` contenente il corpo del messaggio.

source: By default, access tokens expire after 7 days after they are created.
it_it: Per default, i token di accesso scadono dopo 7 giorni dalla loro creazione.

source: By default, it assumes `http://localhost:1880`.
it_it: Per impostazione predefinita, presuppone `http://localhost:1880`.

source: By default, it will use the `Authorization` http header and expect a `Bearer` type token - passing in just the value of the token to the function.
it_it: Per default, utilizzerà l'header HTTP `Authorization` e si aspetterà un token di tipo `Bearer`, passando alla funzione solo il valore del token.

source: By default, the Node-RED editor is not secured - anyone who can access its IP address can access the editor and deploy changes.
it_it: Per default, l'editor di Node-RED non è protetto: chiunque abbia accesso al suo indirizzo IP può accedervi e distribuire le modifiche.

source: By default, the `callbackURL` will listen for `GET` requests.
it_it: Per default, `callbackURL` ascolterà le richieste `GET`.

source: By indenting the flows on the page, you can indicate an implied grouping of the different components.
it_it: Indentando i flussi sulla pagina, è possibile indicare un raggruppamento implicito dei diversi componenti.

source: By setting `functionExternalModules` to `true` in you *settings.js* file, the Function node's edit dialog will provide a list where you can add additional modules that should be available to the node.
it_it: Impostando `functionExternalModules` a `true` nel file *settings.js*, la finestra di dialogo di modifica del nodo Funzione fornirà un elenco in cui è possibile aggiungere ulteriori moduli che dovrebbero essere disponibili per il nodo.

source: Choosing good names for things applies just as much to the tabs and subflows used.
it_it: La scelta di nomi appropriati per gli elementi si applica anche alle schede e ai `Subflow` utilizzati.

source: Configuring Node-RED
it_it: Configurazione di Node-RED

source: Custom Middleware
it_it: Middleware Personalizzato

source: Custom Middleware for Admin API
it_it: Middleware personalizzato per l'API Admin

source: Custom Middleware for http-in nodes
it_it: Middleware personalizzato per i nodi http-in

source: Custom authentication tokens
it_it: Token di autenticazione personalizzati

source: Custom user authentication
it_it: Autenticazione utente personalizzata

source: Customising flows for different platforms
it_it: Personalizzazione dei Flussi per Diverse Piattaforme

source: Customising subflows
it_it: Personalizzazione dei `Subflow`

source: Designing message properties
it_it: Progettazione delle Proprietà del Messaggio

source: Developing Flows
it_it: Sviluppo di Flussi:

source: Developing Flows:
it_it: Sviluppo di Flussi:

source: Each method of the [Admin API](/docs/api/admin) defines what permission level is needed to access it.
it_it: Ogni metodo dell'[API Admin](/docs/api/admin) definisce il livello di autorizzazione necessario per accedervi.

source: Editor & Admin API security
it_it: Sicurezza dell'Editor e dell'API di Amministrazione

source: Either by adding a `close` event handler:
it_it: Aggiungendo un gestore di eventi `close`:

source: Enabling HTTPS Access
it_it: Abilitazione dell'accesso HTTPS

source: Environment variables can be used more widely within Node-RED to create flows that can be customised for different platforms without having to make manual changes.
it_it: Le variabili d'ambiente possono essere utilizzate più ampiamente all'interno di Node-RED per creare flussi personalizzabili per diverse piattaforme senza dover apportare modifiche manuali.

source: Error handling
it_it: Gestione degli Errori

source: Every node, group and tab can have longer-form documentation added under the [Description tab in their edit dialog](/docs/user-guide/editor/workspace/nodes#editing-node-properties).
it_it: Per ogni nodo, gruppo e "Tab" [scheda] è possibile aggiungere una documentazione più estesa nel [Tab Description nella finestra di dialogo di edit](/docs/user-guide/editor/workspace/nodes#editing-node-properties).

source: Finishing with a message
it_it: Terminare con un messaggio

source: Follow us on:
it_it: Seguirci su :

source: For a home-automation application, you could put the flow logic for each room on a separate tab to reflect the physical space.
it_it: Per un'applicazione di domotica, si potrebbe inserire la logica di flusso per ogni stanza in una scheda separata per riflettere lo spazio fisico.

source: For details of the accepted parameters see the [Node Status documentation](/docs/creating-nodes/status)
it_it: Per i dettagli sui parametri accettati, consultare la [documentazione sullo Stato del nodo](/docs/creating-nodes/status)

source: For example
it_it: Per esempio

source: For example if you wish to spread incoming messages randomly between outputs, you could:
it_it: Ad esempio, se si desidera distribuire i messaggi in arrivo in modo casuale tra gli output, è possibile:

source: For example, `msg.temperature` is much more understandable than `msg.t`.
it_it: Ad esempio, `msg.temperature` è molto più comprensibile di `msg.t`.

source: For example, both a `memory` and `file` based store could be used.
it_it: Ad esempio, è possibile utilizzare sia un archivio basato su `memory` che su `file`.

source: For example, changing what MQTT topic it publishes to.
it_it: Ad esempio, modificando l'argomento MQTT su cui pubblica.

source: For example, consider a flow that receives an id in the payload of an MQTT message.
it_it: Ad esempio, si consideri un flusso che riceve un ID nel payload di un messaggio MQTT.

source: For example, if a Change node has a single rule that sets `msg.payload` to the current time, its default label will be `set msg.payload`.
it_it: Ad esempio, se un nodo "Change" ha una singola regola che imposta `msg.payload` sull'ora corrente, la sua etichetta predefinita sarà `set msg.payload`.

source: For example, if you access the editor at `http://localhost:1880`, you would use `http://localhost:1880/auth/strategy/callback`.
it_it: Per esempio, se si accede all'editor all'indirizzo `http://localhost:1880`, si utilizzerà `http://localhost:1880/auth/strategy/callback`.

source: For example, if you have a number of MQTT In nodes for different types of device, customising the icon to match the type of device could be helpful.
it_it: Ad esempio, se si dispone di diversi nodi "MQTT In" per diversi tipi di dispositivi, potrebbe essere utile personalizzare l'icona in base al tipo di dispositivo.

source: For example, in most cases, a Function node should send on the same message object it received rather than create a new message object.
it_it: Ad esempio, nella maggior parte dei casi, un nodo Function dovrebbe inviare sullo stesso oggetto messaggio ricevuto anziché creare un nuovo oggetto messaggio.

source: For example, it can initialise values in local context that the main Function will use:
it_it: Ad esempio, può inizializzare i valori nel contesto locale che la Funzione principale utilizzerà:

source: For example, keeping a count of how many messages pass through a flow, or the current state of an external sensor.
it_it: Ad esempio, tenere un conteggio del numero di messaggi che attraversano un flusso o lo stato corrente di un sensore esterno.

source: For example, the MQTT In node will set `msg.topic` to topic the message was received on.
it_it: Ad esempio, il nodo "MQTT In" imposterà `msg.topic` sul "topic" [argomento] su cui è stato ricevuto il messaggio.

source: For example, the Switch node provides default labels for its outputs that are shown when the mouse hovers over them.
it_it: Ad esempio, il nodo Switch fornisce etichette di default per i suoi output, visualizzate quando il mouse vi passa sopra.

source: For example, the built-in `os` module can be made available to all functions by adding the following to your *settings.js* file.
it_it: Ad esempio, il modulo `os` integrato può essere reso disponibile a tutte le funzioni aggiungendo quanto segue al file *settings.js*.

source: For example, the following middleware could be used to set the `X-Frame-Options` http header on all admin/editor requests.
it_it: Ad esempio, il middleware seguente potrebbe essere utilizzato per impostare l'intestazione HTTP `X-Frame-Options` su tutte le richieste admin/editor.

source: For example, this function would send anything on topic `banana` to the second output rather than the first:
it_it: Ad esempio, questa funzione invierebbe qualsiasi messaggio sull'argomento `banana` al secondo output anziché al primo:

source: For example, to get the current flow configuration, a user will require the `flows.read` permission.
it_it: Ad esempio, per ottenere la configurazione corrente del flusso, un utente avrà bisogno dell'autorizzazione `flows.read`.

source: For example, to set the tokens to expire after 1 day:
it_it: Ad esempio, per impostare la scadenza dei token dopo 1 giorno:

source: For example, where you want to share the state information across multiple Node-RED instances, or in the case of MQTT, be able to trigger a flow whenever a value changes.
it_it: Ad esempio, per condividere le informazioni sullo stato tra più istanze di Node-RED o, nel caso di MQTT, essere in grado di attivare un flusso ogni volta che un valore cambia.

source: For example, you may have a flow that you plan to run on multiple devices, but each device should subscribe to its own unique MQTT topic.
it_it: Ad esempio, si potrebbe avere un flusso che si prevede di eseguire su più dispositivi, ma ogni dispositivo dovrebbe sottoscrivere il proprio argomento MQTT univoco.

source: For example:
it_it: Ad esempio:

source: For finer grained logging, `node.trace()` and `node.debug()` are also available.
it_it: Per un logging più dettagliato, sono disponibili anche `node.trace()` e `node.debug()`.

source: For more information about how they can be used, refer to the [user guide](/docs/user-guide/handling-errors).
it_it: Per ulteriori informazioni sul loro utilizzo, consultare la [guida utente](/docs/user-guide/handling-errors).

source: For more information about messages in Node-RED you should read the [Working with messages](/docs/user-guide/messages) section of the user guide.
it_it: Per ulteriori informazioni sui messaggi in Node-RED, consultare la sezione [Lavorare con i Messaggi](/docs/user-guide/messages) della guida utente.

source: For most users that will be the default user directory - `~/.node-red`:
it_it: Per la maggior parte degli utenti, questa sarà la directory utente predefinita: `~/.node-red`:

source: For older versions of Node-RED, you can either:
it_it: Per le versioni precedenti di Node-RED, si può:

source: For some nodes, it might be appropriate to hide the label altogether to minimise the horizontal space it uses in the flow - giving more room to other nodes.
it_it: Per alcuni nodi, potrebbe essere opportuno nascondere completamente l'etichetta per ridurre al minimo lo spazio orizzontale che occupa nel flusso, lasciando più spazio agli altri nodi.

source: For the `HTTP In` nodes, the middleware is provided as the `httpNodeMiddleware` setting.
it_it: Per i nodi `HTTP In`, il middleware viene fornito come impostazione `httpNodeMiddleware`.

source: For the admin/editor routes, the middleware is provided as the `httpAdminMiddleware` setting.
it_it: Per le route admin/editor, il middleware viene fornito come impostazione `httpAdminMiddleware`.

source: From Node-RED 0.14 the permissions can be much finer grained and to support that, the property can either be a single string as before, or an array containing multiple permissions.
it_it: A partire da Node-RED 0.14, le autorizzazioni possono essere definite in modo molto più dettagliato e, a tal fine, la proprietà può essere una singola stringa, come in precedenza, oppure un array contenente più autorizzazioni.

source: Generating the password hash
it_it: Generazione dell'hash della password

source: Get/Set multiple values
it_it: Get/Set di valori multipli

source: Getting Started
it_it: Per Iniziare

source: Giving your Catch nodes a clear name is also very important to help easily identify the scenarios they are intended to handle.
it_it: Anche assegnare un nome chiaro ai nodi Catch è molto importante per identificare facilmente gli scenari che devono gestire.

source: Global context
it_it: Contesto globale

source: Good documentation serves a number of purposes:
it_it: Una buona documentazione ha diversi scopi:

source: Grouping nodes
it_it: Raggruppamento dei Nodi

source: Groups can be used to identify discrete sections of the flows.
it_it: I gruppi possono essere utilizzati per identificare sezioni distinte dei flussi.

source: HTTP Node security
it_it: Sicurezza del Nodo HTTP

source: Handling a Timeout
it_it: Gestione di un Timeout

source: Handling arbitrary number of outputs
it_it: Gestione di un numero arbitrario di output

source: Handling errors
it_it: Gestione degli errori

source: However each instance of the subflow is independent of the others.
it_it: Tuttavia, ogni istanza del `Subflow` è indipendente dalle altre.

source: If [authentication](/docs/user-guide/runtime/securing-node-red) is enabled, you must then `login`:
it_it: Se [authentication](/docs/user-guide/runtime/securing-node-red) è abilitato, è necessario quindi eseguire `login`:

source: If a Function node does asynchronous work with a message, the runtime will not automatically know when it has finished handling the message.
it_it: Se un nodo Funzione esegue un lavoro asincrono con un messaggio, il runtime non saprà automaticamente quando ha terminato di gestirlo.

source: If a flow provides an external API you will want to document how that API should be used - what properties or parameters are expected.
it_it: Se un flusso fornisce un'API esterna, si dovrà documentare come tale API dovrebbe essere utilizzata, ovvero quali proprietà o parametri sono previsti.
